sj15712795029/bluetooth_stack/project/stm32f10x_bb_csr8x11_bt/main.c
    HW_DEBUG("OPERATE:%s\n",operate_value);
    if(hw_strcmp(BT_START_CMD,(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate BT_START\n");
        bt_start(&bt_app_cb);
        operate_stauts_oled_show("BT",operate_value,"SUCCESS",0,0,0,0,0,0);
        return HW_ERR_OK;
    }

    if(hw_strcmp(BT_STOP_CMD,(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate bt stop\n");
        bt_stop();
        return 0;
    }

    if(hw_strcmp(BT_INQUIRY_CMD,(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate BT_INQUIRY\n");
        bt_start_inquiry(0x30,HCI_INQUIRY_MAX_DEV);
        return HW_ERR_OK;
    }

    if(hw_strcmp(BT_CANCEL_INQUIRY_CMD,(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate bt cancel inquiry\n");
        bt_stop_inquiry();
        return 0;
    }

#if PROFILE_SPP_ENABLE > 0
    if(hw_strcmp(BT_SPP_SEND_CMD,(const char*)operate_value) == 0)
    {
        uint16_t send_len = atoi((const char*)para2);
        HW_DEBUG("SHELL:operate bt spp send\n");
        spp_send_data(&connect_addr,para1,send_len);
        return 0;
    }
#endif

#if PROFILE_HFP_ENABLE > 0
    if(hw_strcmp("HFP_NET_N",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate hfp get operate\n");
        bt_hfp_hf_get_operator(&connect_addr);
        return HW_ERR_OK;
    }

    if(hw_strcmp("BT_AUDIO_TRANSFER",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate HFP AUDIO TRANSFER\n");

        bt_hfp_hf_audio_transfer(&connect_addr);
        return HW_ERR_OK;
    }

    if(hw_strcmp("HFP_ANSWER",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate HFP ANSWER INCOMING CALL\n");

        bt_hfp_hf_accept_incoming_call(&connect_addr);
        return HW_ERR_OK;
    }

    if(hw_strcmp("HFP_CALLEND",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate bt end call\n");
        bt_hfp_hf_end_call(&connect_addr);
        return HW_ERR_OK;
    }

    if(hw_strcmp("HFP_CALLOUT_PN",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate call out by number\n");
        bt_hfp_hf_callout_by_number(&connect_addr,para1);
        return HW_ERR_OK;
    }

    if(hw_strcmp("HFP_LPN",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate local number\n");
        bt_hfp_hf_get_local_phone_number(&connect_addr);
        return HW_ERR_OK;
    }

    if(hw_strcmp("HFP_CLCC",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate bt get call list\n");
        bt_hfp_hf_get_call_list(&connect_addr);
        return HW_ERR_OK;
    }

    if(hw_strcmp("HFP_VGM",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate VGM\n");
        bt_hfp_hf_set_mic_volume(&connect_addr,atoi((const char*)para1));
        return HW_ERR_OK;
    }

    if(hw_strcmp("HFP_VGS",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate VGM\n");
        bt_hfp_hf_set_spk_volume(&connect_addr,atoi((const char*)para1));
        return HW_ERR_OK;
    }

	if(hw_strcmp("HFP_DTMF",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate hfp active call dtmf\n");
        bt_hfp_hf_transmit_dtmf(&connect_addr,atoi((const char*)para1));
        return HW_ERR_OK;
    }

	if(hw_strcmp("HFP_VGE",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate voice_recognition enable\n");
        bt_hfp_hf_set_voice_recognition(&connect_addr,1);
        return HW_ERR_OK;
    }

    if(hw_strcmp("HFP_VGD",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate voice_recognition disable\n");
        hfp_hf_set_voice_recognition(&connect_addr,0);
        return HW_ERR_OK;
    }

	if(hw_strcmp("HFP_CGMI",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate get manufacturer name\n");
        bt_hfp_hf_get_manufacturer_id(&connect_addr);
        return HW_ERR_OK;
    }

	if(hw_strcmp("HFP_CGMM",(const char*)operate_value) == 0)
    {
        HW_DEBUG("SHELL:operate get module id\n");
        bt_hfp_hf_get_model_id(&connect_addr);
        return HW_ERR_OK;
    }

#endif


    HW_DEBUG("NO OPERATE:%s\n",operate_value);
    return HW_ERR_SHELL_NO_CMD;
}


uint8_t shell_at_cmd_parse(uint8_t *shell_string)
{

    if(hw_strcmp(BT_START_CMD,(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate bt start\n");
        bt_start(&bt_app_cb);
        return HW_ERR_OK;
    }

    if(hw_strcmp(BT_STOP_CMD,(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate bt stop\n");
        bt_stop();
        return HW_ERR_OK;
    }

    if(hw_strcmp(BT_INQUIRY_CMD,(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate bt inquiry\n");
        bt_start_inquiry(0x30,HCI_INQUIRY_MAX_DEV);
        return HW_ERR_OK;
    }

    if(hw_strcmp(BT_CANCEL_INQUIRY_CMD,(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate bt cancel inquiry\n");
        bt_stop_inquiry();
        return 0;
    }

#if BT_BLE_ENABLE > 0
    if(hw_strcmp(BT_LE_INQUIRY_CMD,(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate ble inquiry\n");
        bt_le_start_inquiry();
        return HW_ERR_OK;
    }

    if(hw_strcmp(BT_LE_INQUIRY_CANCEL_CMD,(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate ble cancel inquiry\n");
        bt_le_stop_inquiry();
        return 0;
    }

    if(hw_strcmp(BT_LE_ADV_ENABLE_CMD,(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate ble start advertising\n");
        bt_le_set_adv_enable(adv_data_len,adv_data);
        return HW_ERR_OK;
    }

    if(hw_strcmp(BT_LE_ADV_DISABLE_CMD,(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate ble stop advertising\n");
        bt_le_set_adv_disable();
        return 0;
    }

#endif


#if PROFILE_SPP_ENABLE > 0
    if(hw_strcmp("SPP_SEND",(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate bt stop\n");
        spp_send_data(&connect_addr,"111111",hw_strlen("111111"));
        return HW_ERR_OK;
    }


    if(hw_strcmp("SPP_DISCON",(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate spp DISCON\n");

        spp_disconnect(&connect_addr);
        return HW_ERR_OK;
    }
#endif

#if PROFILE_PBAP_ENABLE > 0
    if(hw_strcmp("PBAP_CON",(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate PBAP CON\n");

        pbap_client_connect(&connect_addr);
        return HW_ERR_OK;
    }

    if(hw_strcmp("PBAP_DISCON",(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate PBAP DISCON\n");

        pbap_client_disconnect(&connect_addr);
        return HW_ERR_OK;
    }

    if(hw_strcmp("PBAP_LP",(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate PBAP PBAP_LPB\n");

        pbap_client_download_phonebook(&connect_addr,PB_LOCAL_REPOSITORY,PB_PHONEBOOK_TYPE);
        return HW_ERR_OK;
    }

    if(hw_strcmp("PBAP_LI",(const char*)shell_string) == 0)
    {
        HW_DEBUG("SHELL:operate PBAP PBAP_LI\n");

